bonaventureli/ble_services/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hrs_sdk/main.c
#define DEAD_BEEF                           0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */


BLE_HRS_DEF(m_hrs);                                                 /**< Heart rate service instance. */
BLE_BAS_DEF(m_bas);                                                 /**< Structure used to identify the battery service. */
NRF_BLE_GATT_DEF(m_gatt);                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                 /**< Advertising module instance. */
APP_TIMER_DEF(m_battery_timer_id);                                  /**< Battery timer. */
APP_TIMER_DEF(m_heart_rate_timer_id);                               /**< Heart rate measurement timer. */
APP_TIMER_DEF(m_rr_interval_timer_id);                              /**< RR interval timer. */
APP_TIMER_DEF(m_sensor_contact_timer_id);                           /**< Sensor contact detected timer. */

static uint16_t m_conn_handle         = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */
static bool     m_rr_interval_enabled = true;                       /**< Flag for enabling and disabling the registration of new RR interval measurements (the purpose of disabling this is just to test sending HRM without RR interval data. */

static sensorsim_cfg_t   m_battery_sim_cfg;                         /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t m_battery_sim_state;                       /**< Battery Level sensor simulator state. */
static sensorsim_cfg_t   m_heart_rate_sim_cfg;                      /**< Heart Rate sensor simulator configuration. */
static sensorsim_state_t m_heart_rate_sim_state;                    /**< Heart Rate sensor simulator state. */
static sensorsim_cfg_t   m_rr_interval_sim_cfg;                     /**< RR Interval sensor simulator configuration. */
static sensorsim_state_t m_rr_interval_sim_state;                   /**< RR Interval sensor simulator state. */

static ble_uuid_t m_adv_uuids[] =                                   /**< Universally unique service identifiers. */
{
    {BLE_UUID_HEART_RATE_SERVICE,           BLE_UUID_TYPE_BLE},
    {BLE_UUID_BATTERY_SERVICE,              BLE_UUID_TYPE_BLE},
    {BLE_UUID_DEVICE_INFORMATION_SERVICE,   BLE_UUID_TYPE_BLE},
		//{SDK_UUID_SERVICE, NUS_SERVICE_UUID_TYPE},//add lifei 2018/11/2
};

uint8_t gActive;
uint8_t gReturnInfo[29];
unsigned int gReturnInfoLen;
uint8_t gReturnSession[131];
unsigned int gReturnSessionLen;


uint8_t VIN_data[17];
uint8_t CMPK_data[48];

uint8_t VIN_CMPK_data[70];//65

uint8_t Rand_data[32]={
0xB1,0xB1,0xB3,0xB4,0xB5,0xB6,0xB7,0xB8,0xB9,0xBF,
0xB1,0xB1,0xB3,0xB4,0xB5,0xB6,0xB7,0xB8,0xB9,0xBF,
0xB1,0xB1,0xB3,0xB4,0xB5,0xB6,0xB7,0xB8,0xB9,0xBF,
0xB1,0xB1
};

int read_CB1(unsigned char *out, unsigned int rlen, unsigned int offset)
{
	
	//NRF_LOG_INFO("  read_CB1  ");
	uint32_t * addr;
	addr = (uint32_t *)0x79000;
	
	
	#if USE_DATA_FLASH
	SdkRead(out,rlen,offset);
	#else
		//memcpy(out,Callback_data+offset,rlen);
	#endif
	if(rlen == 17){
		//NRF_LOG_INFO("VIN");
		memcpy(out,VIN_data,rlen);
		storageReadData(out,rlen,offset);
		NRF_LOG_INFO("read_CB1 VIN  FSTORAGE_DATA_ADDR_START:  0x%x",(addr+offset));
		NRF_LOG_HEXDUMP_INFO(out, rlen);	
	}
	if(rlen == 48){
		//NRF_LOG_INFO("CMPK");
		memcpy(out,CMPK_data,rlen);
		storageReadData(out,rlen,offset);
		NRF_LOG_INFO("read_CB1 CMPK  FSTORAGE_DATA_ADDR_START:  0x%x",(addr+offset));
		NRF_LOG_HEXDUMP_INFO(out, rlen);	
		NRF_LOG_INFO("read_CB1 flash  FSTORAGE_DATA_ADDR_START:  0x%x",(addr));
		NRF_LOG_HEXDUMP_INFO(addr, 128);
	}
	//NRF_LOG_INFO("  read_CB1_flash end ");
	return 0;
}
/*
* Function:    read_CB1
* Description:        
* Parameter:   None
* Return:      int
* auther: lifei 
* change time£º2018/8/31
*/
int write_CB1(unsigned char *in, unsigned int wlen, unsigned int offset){
	
	//NRF_LOG_INFO("  write_CB1  ");

	#if USE_DATA_FLASH
		SdkWrite(in,wlen,offset);
	#else
		//memcpy(Callback_data+offset,in,wlen);
	#endif
	uint32_t * addr;
	addr = (uint32_t *)0x79000;
	
	
	if(wlen == 17){
	//NRF_LOG_INFO("VIN-17");
	memcpy(VIN_data,in,wlen);
	storageWriteData(in,wlen,offset);
	NRF_LOG_INFO("write_CB1 VIN-17  FSTORAGE_DATA_ADDR_START:  0x%x",(addr+offset));
	NRF_LOG_HEXDUMP_INFO(in, wlen);	
	}
	
	if(wlen == 48){
	//NRF_LOG_INFO("CMPK-48");
	memcpy(CMPK_data,in,wlen);
	storageWriteData(in,wlen,offset);
	NRF_LOG_INFO("write_CB1 CMPK-48  FSTORAGE_DATA_ADDR_START:  0x%x",(addr+offset));
	NRF_LOG_HEXDUMP_INFO(in, wlen);	
	NRF_LOG_INFO("write_CB1 flash  FSTORAGE_DATA_ADDR_START:  0x%x",(addr));
	NRF_LOG_HEXDUMP_INFO(addr, 128);
	}
	//NRF_LOG_INFO("  write_CB1_end  ");
	return 0;
}
/*
* Function:    read_CB1
* Description:        
* Parameter:   None
* Return:      int
* auther: lifei 
* change time£º2018/8/31
*/
int Rand_CB1(void *p_rng, unsigned char *rand, unsigned int randlen){
	
	p_rng = 0;
	
	if(p_rng == 0){
	}
	NRF_LOG_INFO("  Rand_CB1  ");
	
	if(randlen == 8){
		memcpy(rand,Rand_data,8);
		NRF_LOG_INFO("RANDDATA-8");
	}
	if(randlen == 32){
		memcpy(rand,Rand_data,32);
		NRF_LOG_INFO("RANDDATA-32");
	}
	NRF_LOG_HEXDUMP_INFO(rand, randlen);
	return 0;

}
void g_printcb(const char *fmt, int len)
{
//	unsigned char len_t;
//	len_t = (unsigned char)len;
//	Uart3Sent(fmt,len_t);
}

/** @brief Function for getting vector of random numbers.
 *
 * @param[out] p_buff                               Pointer to unit8_t buffer for storing the bytes.
 * @param[in]  length                               Number of bytes to take from pool and place in p_buff.
 *
 * @retval     Number of bytes actually placed in p_buff.
 */ 
static int ikif_random_vector_generate(void * seed ,unsigned char * p_buff, uint32_t size)
{
    uint8_t available;
    uint32_t err_code;
    //err_code = nrf_drv_rng_bytes_available(&available);
		nrf_drv_rng_bytes_available(&available);
    //APP_ERROR_CHECK(err_code);
    uint8_t length = (size<available) ? size : available;
    err_code = nrf_drv_rng_rand(p_buff,length);
    //APP_ERROR_CHECK(err_code);
    return 0;
}

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

