bonaventureli/ble_services/nRF5_SDK_15.2.0_9412b96/examples/ble_peripheral/ble_app_hrs_sdk/main.c
	#if 0
	NRF_LOG_HEXDUMP_INFO(data, data_len);
	ingeek_push_auth(data, data_len, (unsigned char*)1, (unsigned int*)1);
	#endif
	
	#if 0
	
	ingeek_push_auth(data, data_len, (unsigned char*)1, (unsigned int*)1);
	status = ingeek_get_sec_status();
	NRF_LOG_INFO("\nHandle_auth_function:[After] ingeek_push_auth:status:ingeek_get_sec_status is %x. if 2,it is right\n",ingeek_get_sec_status());
	if(status == 0x02)
	ble_send_notify(BLE_UUID_DIGITALKET_STATUS_CHAR, &status, 1);
	#endif
}

void Handle_session(uint8_t *data, uint32_t data_len)
{
	unsigned int outlen;
	uint8_t *preply_data;
	uint8_t status;

	#if 0
	NRF_LOG_INFO("\nHandle_session_function:[Before] ingeek_push_session:status:ingeek_get_sec_status is %x. if 2,it is right\n",ingeek_get_sec_status());
	NRF_LOG_INFO("\nHandle_session_function,return:ingeek_push_session %x, if 0,it is right\n",ingeek_push_session(data, data_len, preply_data, &outlen));
	NRF_LOG_INFO("\nHandle_session_function:[After] ingeek_push_session:status:ingeek_get_sec_status is %x. if 3,it is right\n",ingeek_get_sec_status());
	
	NRF_LOG_INFO("\nHandle_session is ok ,ingeek_push_session,preply_data:\n");
	#endif

	NRF_LOG_HEXDUMP_INFO(data, data_len);
	NRF_LOG_INFO("above is session data,data_len is %d",data_len);
	ingeek_push_session(data, data_len, gReturnSession, &gReturnSessionLen);
	status = ingeek_get_sec_status();
	ble_send_notify(BLE_UUID_DIGITALKET_STATUS_CHAR, &status, 1);
	ble_send_notify(BLE_UUID_DIGITALKET_SESSION_CHAR, gReturnSession, gReturnSessionLen);
	
	#if 0
	ingeek_push_session(data, data_len, preply_data, &outlen);
	NRF_LOG_HEXDUMP_INFO(preply_data, outlen);
	#endif
	
	#if 0
	status = ingeek_get_sec_status();
	ble_send_notify(BLE_UUID_DIGITALKET_STATUS_CHAR, &status, 1);
	ble_send_notify(BLE_UUID_DIGITALKET_SESSION_CHAR, preply_data, outlen);
	#endif

}
extern T_CarCMD CarCMD;
void Handle_cmd(uint8_t *data, uint32_t data_len)
{
	uint8_t *preply_data;
	unsigned int outlen;
	

	DK_Cmd_Meg struct_cmd;
	uint8_t cmd;

	#if 0
	NRF_LOG_HEXDUMP_INFO(data, data_len);
	NRF_LOG_INFO("\nHandle_cmd_function:[Before] ingeek_command_input_action:status:ingeek_get_sec_status is %x. if 3,it is right\n",ingeek_get_sec_status());
	NRF_LOG_INFO("\nHandle_cmd_function,return:ingeek_command_input_action %x, if 0,it is right\n",ingeek_command_input_action(data, data_len, &struct_cmd));
	NRF_LOG_INFO("\nHandle_cmd_function:[After] ingeek_command_input_action:status:ingeek_get_sec_status is %x. if 3,it is right\n",ingeek_get_sec_status());
	#endif
	int i ;
	for(i=0;i<1000;i++);
	ingeek_command_input_action(data, data_len, &struct_cmd);
	for(i=0;i<1000;i++);
	NRF_LOG_INFO("\nHandle_cmd_command: %d \n",(uint8_t)(struct_cmd.command));
	ikcmdSendUart(struct_cmd.command);
	
	
	#if 0
	ingeek_command_input_action(data, data_len, &struct_cmd);
	#endif
	
	#if 0
	NRF_LOG_INFO("\nHandle_cmd_function,return:ingeek_command_output_action %x, if 0,it is right\n",ingeek_command_output_action(&struct_cmd,preply_data, &outlen));
	NRF_LOG_INFO("\nHandle_cmd is ok ,ingeek_command_input_action,preply_data:\n");
	
	#endif
	
	#if 1
	ingeek_command_output_action(&struct_cmd,preply_data, &outlen);
	#endif
	
	ble_send_notify(BLE_UUID_DIGITALKET_CMD_CHAR, preply_data, outlen);

}
#define SESSIONMAXBIT 112
#define INFOCHARMAXBIT 29
#define DK_REPLAY_MAXBIT 128
void ble_hrs_evt_handler (ble_hrs_t * p_hrs, ble_hrs_evt_t * p_evt){

	uint8_t status = 0;
	NRF_LOG_INFO("ble_hrs_evt_handler function==========");
	switch(p_evt->evt_type)
	{
		case BLE_HRS_EVT_NOTIFICATION_ENABLED:
		{
			NRF_LOG_INFO("BLE_EVT_NOTIFICATION_ENABLED");
			break;
		}
		case BLE_HRS_EVT_NOTIFICATION_DISABLED:
		{
			NRF_LOG_INFO("BLE_EVT_NOTIFICATION_DISABLED");

			break;
		}
		case BLE_STATUS_EVT_NOTIFICATION_ENABLED:
		{
			NRF_LOG_INFO("BLE_STATUS_EVT_NOTIFICATION_ENABLED");
				//status = ingeek_get_sec_status();
				//ble_send_notify(BLE_UUID_DIGITALKET_STATUS_CHAR, &status, 1);
			break;
		}
		case BLE_STATUS_EVT_NOTIFICATION_DISABLED:
		{
			NRF_LOG_INFO("BLE_STATUS_EVT_NOTIFICATION_DISABLED");

			break;
		}
		case BLE_INFO_EVT_NOTIFICATION_ENABLED:
		{
			NRF_LOG_INFO("BLE_INFO_EVT_NOTIFICATION_ENABLED");
			//ble_send_notify(BLE_UUID_DIGITALKET_INFO_CHAR, gReturnInfo, gReturnInfoLen);
			break;
		}
		case BLE_INFO_EVT_NOTIFICATION_DISABLED:
		{
			NRF_LOG_INFO("BLE_INFO_EVT_NOTIFICATION_DISABLED");

			break;
		}
		case BLE_SESSION_EVT_NOTIFICATION_ENABLED:
		{
			NRF_LOG_INFO("BLE_SESSION_EVT_NOTIFICATION_ENABLED");
			//ble_send_notify(BLE_UUID_DIGITALKET_SESSION_CHAR, gReturnSession, gReturnSessionLen);
			break;
		}
		case BLE_SESSION_EVT_NOTIFICATION_DISABLED:
		{
			NRF_LOG_INFO("BLE_SESSION_EVT_NOTIFICATION_DISABLED");

			break;
		}
		case BLE_CMD_EVT_NOTIFICATION_ENABLED:
		{
			NRF_LOG_INFO("BLE_CMD_EVT_NOTIFICATION_ENABLED");
			break;
		}
		case BLE_CMD_EVT_NOTIFICATION_DISABLED:
		{
			NRF_LOG_INFO("BLE_CMD_EVT_NOTIFICATION_DISABLED");

			break;
		}		
		case BLE_DIGITAKKEY_EVT_INFO:
		{
			NRF_LOG_INFO("case BLE_DIGITAKKEY_EVT_INFO");
			Handle_info((uint8_t *)p_evt->params.rx_data.p_data, (uint32_t) p_evt->params.rx_data.length);
			break;
		}
		case BLE_DIGITAKKEY_EVT_AUTH:
		{
			NRF_LOG_INFO("case BLE_DIGITAKKEY_EVT_AUTH");
			//NRF_LOG_HEXDUMP_INFO((uint8_t *)p_evt->params.rx_data.p_data, (uint16_t)p_evt->params.rx_data.length);	
			Handle_auth((uint8_t *)p_evt->params.rx_data.p_data, (uint32_t) p_evt->params.rx_data.length);
			break;
		}
		case BLE_DIGITAKKEY_EVT_SESSION:
		{
			NRF_LOG_INFO("case BLE_DIGITAKKEY_EVT_SESSION");
			Handle_session((uint8_t *)p_evt->params.rx_data.p_data, (uint32_t) p_evt->params.rx_data.length);
			break;
		}
		case BLE_DIGITAKKEY_EVT_CMD:
		{
			NRF_LOG_INFO("case BLE_DIGITAKKEY_EVT_CMD");
			Handle_cmd((uint8_t *)p_evt->params.rx_data.p_data, (uint32_t) p_evt->params.rx_data.length);
			break;
		}
		
		case BLE_DIGITAKKEY_EVT_RSSI:
		{
			NRF_LOG_INFO("case BLE_DIGITAKKEY_EVT_RSSI");
			NRF_LOG_HEXDUMP_INFO((uint8_t *)p_evt->params.rx_data.p_data, (uint16_t)p_evt->params.rx_data.length);	
			break;
		}
		#if 0
		case BLE_DIGITAKKEY_EVT_VERSION:
		{
			NRF_LOG_INFO("This is BLE_DIGITAKKEY_EVT_VERSION function add lifei 2018/11/2 17:52.");
			NRF_LOG_HEXDUMP_INFO((uint8_t *)p_evt->params.rx_data.p_data, (uint16_t)p_evt->params.rx_data.length);	
			//Handle_cmd((uint8_t *)p_evt->params.rx_data.p_data, (uint32_t) p_evt->params.rx_data.length);
			break;
		}
		
		default:
			NRF_LOG_INFO("This is ble_hrs_evt_handler function add lifei 2018/11/2 17:18.");
			break;
		#endif
	}
	
